# Real grade-7 vocabulary, scraped 2026-07-08.
# Sources:
#   - Flocabulary "7th Grade Vocabulary Word List" (words from basal readers /
#     books commonly taught in 7th grade, cross-checked against ELA state tests):
#     https://www.flocabulary.com/7th-grade-vocabulary-word-list/
#   - GreatSchools "Academic vocabulary words for 7th graders" (Hyde Park
#     Central School District list):
#     https://www.greatschools.org/gk/parenting/vocabulary/academic-vocabulary-words-for-seventh-graders/
#   - Prestwick House "100 Vocabulary Words for 7th Grade Students":
#     https://www.prestwickhouse.com/blog/post/2023/04/100-vocabulary-words-for-7th-grade-students
# One word per line, lowercased, deduped.
abate
abbreviate
abdicate
abnormal
abode
abrasive
abrupt
abruptly
accelerate
acclaim
acknowledge
acquire
acrid
addict
adequate
adjacent
admonish
affiliation
affliction
agitate
ajar
akin
allege
allocate
alternative
amendment
annihilate
anonymous
antagonize
apathy
arbitrary
arbitrate
aspire
assail
astute
attentive
attribute
authentic
avert
badger
bamboozle
belligerent
bellow
beseech
bestow
bewilder
bias
bigot
bizarre
blatant
bleak
boycott
braggart
brawl
brevity
browse
bystander
candid
canine
canny
capricious
capsize
casual
casualty
catastrophe
cater
characterize
chronological
chorus
circumference
citrus
clamber
climax
companionship
compel
competent
component
composure
compromise
conclusive
concur
condemn
condense
confront
congested
conjure
connotation
consecutive
conspicuous
consult
contract
contrast
convection
copious
correspond
corrupt
counterfeit
covet
customary
dawdle
debut
deceased
deceitful
demeanor
dependent
derogatory
despondent
detach
detest
devastate
devious
devour
dexterity
diameter
dishearten
dismal
dismantle
distract
distraught
diversity
docile
downright
dreg
drone
dumbfound
duress
elapse
eligible
emblem
eminent
emphasize
endure
engross
ensue
enthrall
epidemic
erode
estimate
ethics
evaluate
exhilarating
exonerated
exposition
exuberant
fabricate
fabulous
famished
fathom
feud
figment
firebrand
fitful
flabbergast
flagrant
flamboyant
flaw
flourish
formidable
foster
fray
frugal
fruitful
fruitless
gaudy
geography
gratify
gravity
grim
grimy
grueling
gruesome
haggle
headlong
hilarious
hilarity
homage
homicide
horizontal
hospitable
hostile
hurtle
hybrid
hypothetical
illiterate
impartial
impede
impermanent
implore
improvise
incident
incoherent
incredulous
indifferent
industrious
inevitable
infamous
infuriate
inhabitants
inhibit
initiate
insinuate
intimidate
inundate
irate
irrelevant
jostle
jubilant
lavish
legacy
legendary
legitimate
lethal
liaison
libel
linguistic
loath
ludicrous
lurk
magnetic
magnitude
mammoth
mandatory
manufacture
mar
maternal
maul
melancholy
mellow
mentor
militant
mirth
miscellaneous
mitigate
momentum
morose
mortify
mull
mundane
murky
mythology
naive
narrate
narrative
necessity
negligent
nimble
nomadic
nominal
noteworthy
notify
notorious
nullify
nurture
obnoxious
obscure
obsolete
omit
opponent
opposition
oppress
oration
orthodox
overwhelm
paltry
pamper
patronize
peevish
pelt
pending
perceive
perceived
perjury
permanent
permeate
persist
persistent
persuasive
perturb
pique
placate
pluck
poised
ponder
potential
precipitation
preclude
predatory
prediction
prelude
premise
presume
preview
prior
profound
prominent
proposition
prospective
prowess
prudent
punctual
quench
quote
radiant
rampart
random
rant
realm
recede
rejuvenate
relinquish
remnant
remote
reprehensible
repress
reprimand
resolve
respite
resume
retort
retract
reverberate
robust
rudimentary
rupture
ruse
saga
sanctuary
saturate
scamper
sequel
sham
shirk
signify
simultaneously
singular
slake
snare
sortie
sovereign
species
stagnate
status
stodgy
subordinate
substantial
subtle
succession
succumb
sullen
supervise
suspense
talisman
tamper
tentative
tertiary
throb
toxic
tragedy
transgress
treason
trickle
trivial
uncertainty
unscathed
upright
urgent
utmost
vengeance
viable
vicious
viewpoint
vindictive
vista
vocation
void
wary
whim
wince
wrath
yearn
